import '../../model/quiz_item/quiz_item.dart';

List<QuizItem> get category1_5 => [
      QuizItem(
        quizId: 1,
        question: 'データの収集・分析を基にして意思決定や事業展開を行う社会を何というか？',
        ans: 'データ駆動型社会',
        choices: ["情報社会", "データ駆動型社会", "ネットワーク社会", "デジタル社会"],
        comment: "データ駆動型社会は、大量のデータを収集・分析し、それを基にして意思決定や事業展開を行う社会。",
      ),
      QuizItem(
        quizId: 2,
        question: '新しい技術やサービスを活用して事業や生活を変革することを何というか？',
        ans: 'デジタルトランスフォーメーション',
        choices: ["イノベーション", "デジタルトランスフォーメーション", "リストラクチャリング", "グローバライゼーション"],
        comment: "デジタルトランスフォーメーションは、デジタル技術を活用して、企業や社会の様々な領域で革新的な変化を実現すること。",
      ),
      QuizItem(
        quizId: 3,
        question: '特定の地域で規制緩和や特別な経済政策を実施する法律を何というか？',
        ans: '国家戦略特区法',
        choices: ["新産業政策法", "国家戦略特区法", "経済自由区法", "特別経済区法"],
        comment: "国家戦略特区法は、特定の地域で規制緩和や特別な経済政策を実施し、新たな事業の創出や地域活性化を促進するための法律。",
      ),
      QuizItem(
        quizId: 4,
        question: '官民のデータを共有・活用することを促進する法律を何というか？',
        ans: '官民データ活用推進基本法',
        choices: ["情報開示法", "データプライバシー法", "官民データ活用推進基本法", "パブリックアクセス法"],
        comment:
            "官民データ活用推進基本法は、官民のデータを効果的に共有・活用することで、新たなサービスの創出や社会課題の解決を促進する法律。",
      ),
      QuizItem(
        quizId: 5,
        question: 'デジタル化を推進し、デジタル社会の形成を目指す基本的な法律を何というか？',
        ans: 'デジタル社会形成基本法',
        choices: ["サイバーセキュリティ基本法", "デジタル社会形成基本法", "電子政府法", "情報通信基盤法"],
        comment: "デジタル社会形成基本法は、デジタル技術の活用を促進し、より便利で効率的な社会の形成を目指すための基本的な法律。",
      ),
    ];
